tap "nikitabobko/tap" # Aerospace

# CLI Tools
brew "git"
brew "gh"
brew "tailscale"     # Secure mesh VPN for homelab and remote access

# Languages n stuff
brew "dotnet"
brew "node"
brew "nvm"

# GUI Applications
cask "iterm2"
cask "bitwarden"
cask "raycast"
cask "visual-studio-code"
cask "docker"
cask "aerospace"
cask "caffeine"
cask "discord"
cask "shottr"
cask "unnaturalscrollwheels" 
cask "spotify" 

# Fonts
cask "font-jetbrains-mono-nerd-font"